In [5]:
import pandas as pd

dataframe =  pd.read_csv("C://Users//wkdal//Desktop//archive//titanic.csv")

dataframe.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [8]:
#차원 확인
dataframe.shape

## shape옆에 괄호  x -> tuple인식

(1310, 14)

In [10]:
# 통계

dataframe.describe()

## describe() 에 괄호 꼭 붙이시오. 괄호 없으면 참조만함.

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [ ]:
# pclass
## count : 총 pclass에 탑승한 사람 수

#survived
## 생존자는 평균 0.381971. 40퍼센트 정도
## 75%가 1이면 상위 25%가 모두 생존자(1)

#age
## 전체 승객의 나이의 중앙값은 28세, 상위 25% 승객은 나이가 39세

#sibsp (siblings, 형제자매/ spouses aboard, 배우자)
## 전체 승객의 상위 25%가 1.0 형제/자매 배우자 중 1명과 탑승
## 8.0은 형제/자매 배우자가 가장 많이 탑승


#parch ("parents, 부모/children aboard, 자녀의 수)
## 0 부모나 자녀 없이 혼자,
## 9.0 부모나 자녀랑 같이 최대의 수

#fare (요금)
## 상위25퍼센트는 31, 상위 50퍼센트는 14, 상위 75퍼센트는 7 fare 금액.

# Body 시신 식별 번호, 사망자 중 시신이 식별된 경우에만 값
## count	121명 → 시신이 확인된 승객 수 (전체 1309명 중 일부)
## mean	약 160.8 → 시신 번호의 평균값 (의미보다는 분포 파악용)
## std	약 97.7 → 시신 번호들의 표준편차, 분산 정도를 의미
## min	1 → 가장 첫 번째로 시신이 식별된 승객
## 25%	72 → 하위 25%의 시신 번호는 72 이하
## 50%	155 → 중앙값, 절반은 155 이하 시신 번호
## 75%	256 → 상위 25%는 시신 번호 256 이상
## max	328 → 가장 마지막으로 확인된 시신 번호
## NaN 이면 생존자/ 시신 식별 X